src/cfe/package-manager/DataProcessors/пм_МенеджерПакетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>пм_МенеджерПакетов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cfe/package-manager/InformationRegisters/пм_УстановленныеПакеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>пм_УстановленныеПакеты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/package-manager/DataProcessors/пм_МенеджерПакетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Загружает актуальные версии пакетов на текущую дату.
//
// Параметры:
//  ПараметрыЗагрузки - Структура - см. НовыеПараметрыЗагрузкиПакета()
//  АдресРезультата - Строка - адрес во временном хранилище для помещения результатов загрузки.
//
Процедура ЗагрузитьАктуальныеВерсииПакетов(ПараметрыЗагрузки, АдресРезультата = Неопределено) Экспорт

	Результат = ЗагрузитьПакетыПоПараметрам(ПараметрыЗагрузки);
			
	Если АдресРезультата <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеМенеджераПакетов(ПараметрыКоманды) Экспорт
	
	ЛимитВерсий = ПараметрыКоманды.ЛимитВерсий;
	ИдентификаторСистемы = ПараметрыКоманды.ИдентификаторСистемы;
	ФильтрВерсий = ПараметрыКоманды.ФильтрВерсий;
	
	Пакеты = НоваяТаблицаПакетов();
	Версии = НоваяТаблицаВерсий();
	Категории = НоваяТаблицаКатегорий();
		
	Сессия = пм_КоннекторHTTP.СоздатьСессию();
	ДобавитьЗаголовокАвторизацииGitLab(Сессия);
	
	// Получаем конфигурацию менеджера пакетов из файла packages.json	
	Конфигурация = ЗагрузитьКонфигурациюМенеджераПакетов();
	
	// Заполняем категории	
	ЗаполнитьКатегории(Категории, Конфигурация.Получить("categories"));

	// Заполняем пакеты и получаем их версии		
	УстановленныеПакеты = РегистрыСведений.пм_УстановленныеПакеты.ВерсииПакетов();
	ОписанияПакетов = Конфигурация.Получить("packages");
	
	Для Каждого ОписаниеПакета Из ОписанияПакетов Цикл
		
		ИмяПакета = ОписаниеПакета.Получить("name");
		Описание = ОписаниеПакета.Получить("description");
		Категория = ОписаниеПакета.Получить("category");
		МетодОбработчик = ОписаниеПакета.Получить("handler");
		
		// Для групп пакетов добавляется префикс - идентификатор системы
		ЭтоГруппа = ОписаниеПакета.Получить("is_package_group");
		Если ЗначениеЗаполнено(ЭтоГруппа) И ЭтоГруппа Тогда
			Если Не ЗначениеЗаполнено(ИдентификаторСистемы) Тогда
				Продолжить;
			КонецЕсли;
			ИмяПакета = ИдентификаторСистемы + "_" + ИмяПакета;
		КонецЕсли;
		
		СтрокаПакета = Пакеты.Добавить();
		СтрокаПакета.Имя = ИмяПакета;			
		СтрокаПакета.Описание = Описание;
		СтрокаПакета.Категория = Категория;			
		СтрокаПакета.МетодОбработчик = МетодОбработчик;			
		СтрокаПакета.ЭтоГруппа = ЭтоГруппа;			

		МассивСтрок = УстановленныеПакеты.НайтиСтроки(Новый Структура("Пакет", ИмяПакета));
		Если МассивСтрок.Количество() > 0 Тогда
			СтрокаПакета.УстановленнаяВерсия = МассивСтрок[0].Версия;
		КонецЕсли;

		МассивВерсий = ЗапросВерсииПакета(
			ИмяПакета, 
			ФильтрВерсий,
			ЛимитВерсий,
			Сессия);
		
		Для Каждого Версия Из МассивВерсий Цикл			
			ИдПакета = Версия.Получить("id");
			НомерВерсии = Версия.Получить("version");
			ДатаСоздания = Версия.Получить("created_at");
						
			// Определяем содержимое пакета
			ФайлыПакета = ФайлыПакета(ИдПакета, Сессия);
			Если ФайлыПакета.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяФайла = ФайлыПакета[0].Получить("file_name");
			Если ИмяФайла = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыУстановки = ОпределитьПараметрыУстановкиПоИмениФайла(ИмяФайла);			
			СтрокаПакета.ТребуетсяПерезагрузка = ПараметрыУстановки.ЭтоРасширение;
			Если Не ЗначениеЗаполнено(МетодОбработчик) Тогда
				СтрокаПакета.МетодОбработчик = ПараметрыУстановки.МетодОбработчик;
			КонецЕсли;

			Строка = Версии.Добавить();
			Строка.Ид = ИдПакета;
			Строка.Номер = НомерВерсии;
			Строка.ИмяПакета = ИмяПакета;
			Строка.ДатаСоздания = ПрочитатьДатуJSON(ДатаСоздания, ФорматДатыJSON.ISO);			
			Строка.ИмяФайла = ИмяФайла;													
		КонецЦикла;
				
	КонецЦикла;	
		
	Результат = Новый Структура;
	Результат.Вставить("Категории", Категории);
	Результат.Вставить("Пакеты", Пакеты);
	Результат.Вставить("Версии", Версии);
	
	Возврат Результат;

КонецФункции

// Новые параметры загрузки пакета.
// 
// Возвращаемое значение:
//  Структура - Новые параметры загрузки пакета:
// * ИмяПакета - Строка - Имя пакета 1C:Packages
// * Версия - Строка - Номер версии пакета, необязательный параметр
// * ИмяФайла - Строка - Имя скачиваемого файла пакета, необязательный параметр
// * ТипРелиза - Строка - Тип релиза пакета: stable, rc, dev
// * МетодОбработчик - Строка - Метод установки пакета, необязательный параметры
//
Функция НовыеПараметрыЗагрузкиПакета() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИмяПакета", "");
	Параметры.Вставить("Версия", "");
	Параметры.Вставить("ИмяФайла", "");
	Параметры.Вставить("ТипРелиза", "stable");
	Параметры.Вставить("МетодОбработчик", "");
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЗаголовокАвторизацииGitLab(Сессия)
	
	Токен = пм_МенеджерПакетовКлиентСервер.ТокенДоступаРепозиторияПакетов();
	Если ЗначениеЗаполнено(Токен) Тогда
		Сессия.Заголовки.Вставить("PRIVATE-TOKEN", Токен);
	КонецЕсли;
	
КонецПроцедуры

Функция ЗагрузитьКонфигурациюМенеджераПакетов()
	
	Ответ = СкачатьФайлГитРепозитория(
		пм_МенеджерПакетовКлиентСервер.АдресAPI_Repository(), 
		"packages.json", 
		"main", 
		пм_МенеджерПакетовКлиентСервер.ТокенДоступаРепозиторияПакетов());
		
	ОтветJSON = пм_КоннекторHTTP.КакJson(Ответ);
	
	ФайлДД = Base64Значение(ОтветJSON.Получить("content"));	
	СтрокаJSON = ПолучитьСтрокуИзДвоичныхДанных(ФайлДД);
	
	Попытка
		Значение = пм_ОбщегоНазначения.ЗначениеИзСтрокиJSON(СтрокаJSON, Истина);			
	Исключение
		ВызватьИсключение "Ошибка чтения файла описания пакетов."
	КонецПопытки;
		
	Возврат Значение;
		
КонецФункции

Функция ЗагрузитьПакетыПоПараметрам(ПараметрыЗагрузки, ПриЗагрузкеВозниклиОшибки = Ложь)
	
	СостояниеЗагрузки = Новый Массив;

	Сессия = пм_КоннекторHTTP.СоздатьСессию();
	ДобавитьЗаголовокАвторизацииGitLab(Сессия);
	
	Для Каждого Параметры Из ПараметрыЗагрузки Цикл		
		Результат = ЗагрузитьПакет(Параметры, Сессия, ПриЗагрузкеВозниклиОшибки);									
		СостояниеЗагрузки.Добавить(Результат);
	КонецЦикла;

	Возврат СостояниеЗагрузки;

КонецФункции
	
Функция СкачатьФайлГитРепозитория(АдресAPI, ПутьКФайлу, Ветка, Токен)

	Заголовки = Новый Соответствие;
	Если ЗначениеЗаполнено(Токен) Тогда
		Заголовки.Вставить("PRIVATE-TOKEN", Токен);
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ref", Ветка);
		
	Ответ = пм_КоннекторHTTP.Get(
		АдресAPI + "/files/" + ПутьКФайлу,
		ПараметрыЗапроса, 
		Новый Структура("Заголовки", Заголовки)
	);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка при получении файла описания пакетов из удаленного репозитория.
			|Код ошибки: %1'",
			Ответ.КодСостояния));
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ЗапросВерсииПакета(ИмяПакета, ТипРелиза, ЛимитВерсий, Сессия = Неопределено)

	Если Сессия = Неопределено Тогда
		Сессия = пм_КоннекторHTTP.СоздатьСессию();
		ДобавитьЗаголовокАвторизацииGitLab(Сессия);
	КонецЕсли;
		
	МассивВерсий = Новый Массив;
	
	УспешноПодключили = ПодключитьВнешнююКомпоненту("ОбщийМакет.пм_RegEx", "Component", ТипВнешнейКомпоненты.Native);
	Если Не УспешноПодключили Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось подключить внешнюю компоненту RegEx 1C'");
		ВызватьИсключение ТекстОшибки;				
	КонецЕсли;

	Рег = Новый("AddIn.Component.RegEx");

	Если ТипРелиза = "rc" Тогда
		РегуляркаПроверки = РегуляркаПроверкиПредварительнойВерсии();	
	ИначеЕсли ТипРелиза = "dev" Тогда
		РегуляркаПроверки = РегуляркаПроверкиВерсииРазработки();	
	ИначеЕсли ТипРелиза = "stable" Тогда
		РегуляркаПроверки = РегуляркаПроверкиСтабильнойВерсии();
	Иначе
		РегуляркаПроверки = "";
	КонецЕсли;

	// API списка пакетов использует пагинацию. Обходим все страницы, 
	// либо пока не получим указанное в параметре количество пакетов
	ТребуетсяЗагружатьДанные = Истина;
	НомерСтраницы = Неопределено;
	
	Пока ТребуетсяЗагружатьДанные Цикл
		
		Страница = ПолучитьСтраницуВерсийПакета(ИмяПакета, НомерСтраницы, Сессия);
	
		ВерсииСтраницы = пм_КоннекторHTTP.КакJson(Страница);
		
		Для Каждого Значение Из ВерсииСтраницы Цикл
			Если МассивВерсий.Количество() = ЛимитВерсий Тогда
				ТребуетсяЗагружатьДанные = Ложь;
				Прервать;		
			КонецЕсли;
			
			Версия = Значение.Получить("version");
			
			Если ЗначениеЗаполнено(РегуляркаПроверки) Тогда					
				Рег.НайтиСовпадения(Версия, РегуляркаПроверки, Истина);
					
				Если Рег.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			МассивВерсий.Добавить(Значение);
		КонецЦикла;
				
		НомерСтраницы = Страница.Заголовки.Получить("X-Next-Page");
		Если Не ЗначениеЗаполнено(НомерСтраницы) Тогда
			ТребуетсяЗагружатьДанные = Ложь;	
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат МассивВерсий;
	
КонецФункции

Функция ПолучитьСтраницуВерсийПакета(ИмяПакета, НомерСтраницы, Сессия = Неопределено)

	Если Сессия = Неопределено Тогда
		Сессия = пм_КоннекторHTTP.СоздатьСессию();
		ДобавитьЗаголовокАвторизацииGitLab(Сессия);
	КонецЕсли;

	АдресAPI = пм_МенеджерПакетовКлиентСервер.АдресAPI_Packages();
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("package_name", ИмяПакета);
	ПараметрыЗапроса.Вставить("order_by", "created_at");
	ПараметрыЗапроса.Вставить("sort", "desc");

	Если Не НомерСтраницы = Неопределено Тогда
		ПараметрыЗапроса.Вставить("page", НомерСтраницы);
	КонецЕсли;	
	
	Ответ = пм_КоннекторHTTP.Get(
		АдресAPI,
		ПараметрыЗапроса, 
		, 
		Сессия);
		
	Возврат Ответ;
		
КонецФункции

Функция ФайлыПакета(ИдПакета, Сессия = Неопределено)

	Если Сессия = Неопределено Тогда
		Сессия = пм_КоннекторHTTP.СоздатьСессию();
		ДобавитьЗаголовокАвторизацииGitLab(Сессия);
	КонецЕсли;

	АдресAPI = пм_МенеджерПакетовКлиентСервер.АдресAPI_Packages();
		
	Ответ = пм_КоннекторHTTP.Get(
		АдресAPI + СтрШаблон("/%1/package_files", Формат(ИдПакета, "ЧГ=;"))
		, , , Сессия);
		
	Файлы = пм_КоннекторHTTP.КакJson(Ответ);
	
	Возврат Файлы;
	
КонецФункции

Функция СкачанныеДвоичныеДанныеПакета(ИмяПакета, Версия, ИмяФайла, Сессия = Неопределено)

	Если Сессия = Неопределено Тогда
		Сессия = пм_КоннекторHTTP.СоздатьСессию();
		ДобавитьЗаголовокАвторизацииGitLab(Сессия);
	КонецЕсли;

	АдресAPI = пм_МенеджерПакетовКлиентСервер.АдресAPI_Packages();
		
	Ответ = пм_КоннекторHTTP.Get(
		 АдресAPI + СтрШаблон("/generic/%1/%2/%3", ИмяПакета, Версия, ИмяФайла)
		, , , Сессия);

	Если Ответ.КодСостояния > 300 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Ответ.Тело;
		
КонецФункции

Процедура ЗаполнитьКатегории(Категории, СписокКатегорий)
		
	Строка = Категории.Добавить();
	Строка.Наименование = "Все";

	Для Каждого Категория Из СписокКатегорий Цикл
		Строка = Категории.Добавить();
		Строка.Наименование = Категория;			
	КонецЦикла;
			
КонецПроцедуры

Функция ЗагрузитьПакет(ПараметрыЗагрузки, Сессия = Неопределено, ПриЗагрузкеВозниклиОшибки = Ложь)

	ИмяПакета = ПараметрыЗагрузки.ИмяПакета;
	ТипРелиза = ПараметрыЗагрузки.ТипРелиза;
	Версия = ПараметрыЗагрузки.Версия;
	ИмяФайла = ПараметрыЗагрузки.ИмяФайла;
	МетодОбработчик = ПараметрыЗагрузки.МетодОбработчик;
	
	Если Сессия = Неопределено Тогда
		Сессия = пм_КоннекторHTTP.СоздатьСессию();
		ДобавитьЗаголовокАвторизацииGitLab(Сессия);
	КонецЕсли;
	
	// Если не указана Версия, значит должен быть указан ТипРелиза.
	// Получаем последнюю версию пакета указанного типа релиза.	
	Если Не ЗначениеЗаполнено(Версия) Тогда
		// Получаем последнюю версию указанного типа релиза
		МассивВерсий = ЗапросВерсииПакета(
			ИмяПакета, 
			ТипРелиза,
			1,
			Сессия);
		Если МассивВерсий.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Версий пакета %1 с типом релиза %2 не найдено.'");
			ТекстСообщения = пм_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстСообщения, ИмяПакета, ТипРелиза);
			пм_ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;	
		КонецЕсли;

		ИдПакета = МассивВерсий[0].Получить("id");
		Версия = МассивВерсий[0].Получить("version");
							
		// Определяем содержимое пакета
		ФайлыПакета = ФайлыПакета(ИдПакета, Сессия);
		Если ФайлыПакета.Количество() = 0 Тогда
			Возврат Неопределено;	
		КонецЕсли;
		
		ИмяФайла = ФайлыПакета[0].Получить("file_name");
		Если ИмяФайла = Неопределено Тогда
			Возврат Неопределено;	
		КонецЕсли;
	КонецЕсли;

	Результат = НовыйРезультатЗагрузкиПакета();		
	Результат.ИмяПакета = ИмяПакета;		
	Результат.Версия = Версия;		
	
	// Скачиваем содержимое пакета
	ДвоичныеДанные = СкачанныеДвоичныеДанныеПакета(ИмяПакета, Версия, ИмяФайла, Сессия);
	
	Если ДвоичныеДанные = Неопределено Тогда
		СообщениеОбОшибке = НСтр("ru = 'Не удалось скачать файл пакета с сервера.
		|Имя пакета: %1, Версия: %2, Имя файла: %3'");
		СообщениеОбОшибке = пм_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			СообщениеОбОшибке, ИмяПакета, Версия, ИмяФайла);
		Результат.ТекстОшибки = СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	Если ТипЗнч(ДвоичныеДанные) <> Тип("ДвоичныеДанные") Тогда
		СообщениеОбОшибке = НСтр("ru = 'Неправильный формат файла пакета.
		|Ожидали: Тип ДвоичныеДанные. Получили: Тип %1'");
		СообщениеОбОшибке = пм_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			СообщениеОбОшибке, ТипЗнч(ДвоичныеДанные));
		Результат.ТекстОшибки = СообщениеОбОшибке;			
		Возврат Результат;
	КонецЕсли;
	
	// Определяем метод обработчик установки пакета
	ПараметрыУстановки = ОпределитьПараметрыУстановкиПоИмениФайла(ИмяФайла);
	
	Если Не ЗначениеЗаполнено(МетодОбработчик) Тогда
		МетодОбработчик = ПараметрыУстановки.МетодОбработчик;	
		
		Если Не ЗначениеЗаполнено(МетодОбработчик) Тогда
			СообщениеОбОшибке = НСтр("ru = 'Невозможно определить метод обработки пакета.
			|Имя пакета: %1, Версия: %2, Имя файла: %3'");
			СообщениеОбОшибке = пм_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				СообщениеОбОшибке, ИмяПакета, Версия, ИмяФайла);
			Результат.ТекстОшибки = СообщениеОбОшибке;			
			Возврат Результат;		
		КонецЕсли;
	КонецЕсли;
		
	Попытка
		Если ПараметрыУстановки.ЭтоРасширение Тогда
			// Обновляем версию До установки, по причине возниковения ошибки: 
			// "Структура таблицы несовместима с текущими расширениями" при обновлении После установки.
			// Возникает ошибка при попытке Прочитать или Записать набор записей
			УстановленныеВерсии = РегистрыСведений.пм_УстановленныеПакеты.ВерсииПакетов(ИмяПакета);
			НоваяВерсия = РегистрыСведений.пм_УстановленныеПакеты.СтруктураЗаписи();
			НоваяВерсия.Пакет = ИмяПакета;
			НоваяВерсия.Версия = Версия;			
			РегистрыСведений.пм_УстановленныеПакеты.ОбновитьСведения(НоваяВерсия);
	
			//@skip-warning
			Выполнить(МетодОбработчик + "(ДвоичныеДанные, Результат)");				
			Если Не ПустаяСтрока(Результат.ТекстОшибки) Тогда
				Если УстановленныеВерсии.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(НоваяВерсия, УстановленныеВерсии[0]);
					РегистрыСведений.пм_УстановленныеПакеты.ОбновитьСведения(НоваяВерсия);				
				КонецЕсли;
			КонецЕсли;		
		Иначе
			//@skip-warning
			Выполнить(МетодОбработчик + "(ДвоичныеДанные, Результат)");				
			Если ПустаяСтрока(Результат.ТекстОшибки) Тогда
				НоваяВерсия = РегистрыСведений.пм_УстановленныеПакеты.СтруктураЗаписи();
				НоваяВерсия.Пакет = ИмяПакета;
				НоваяВерсия.Версия = Версия;			
				РегистрыСведений.пм_УстановленныеПакеты.ОбновитьСведения(НоваяВерсия);
			КонецЕсли;			
		КонецЕсли;
	Исключение
		ПриЗагрузкеВозниклиОшибки = Истина;
		Результат.ТекстОшибки = Результат.ТекстОшибки 
			+ ?(ЗначениеЗаполнено(Результат.ТекстОшибки), Символы.ПС, "")
			+ ОписаниеОшибки();			
	КонецПопытки;
						
	Возврат Результат;

КонецФункции

Функция ОпределитьПараметрыУстановкиПоИмениФайла(ИмяФайла)
			
	ЭтоРасширение = СтрЗаканчиваетсяНа(ИмяФайла, ".cfe");
	
	Если ЭтоРасширение Тогда
		МетодОбработчик = МетодОбработчикУстановкиРасширения();
	Иначе
		МетодОбработчик = "";
	КонецЕсли;

	Параметры = Новый Структура;
	Параметры.Вставить("ЭтоРасширение", ЭтоРасширение);
	Параметры.Вставить("МетодОбработчик", МетодОбработчик);	
	
	Возврат Параметры;	
	
КонецФункции

Функция МетодОбработчикУстановкиРасширения()
	Возврат "пм_МенеджерПакетов.ЗагрузитьПакетСРасширением";
КонецФункции

Функция НоваяТаблицаПакетов()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Категория", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("МетодОбработчик", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ТребуетсяПерезагрузка", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ЭтоГруппа", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("УстановленнаяВерсия", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ПорядокПрименения", Новый ОписаниеТипов("Число"));
	
	Возврат Таблица;
	
КонецФункции

Функция НоваяТаблицаВерсий()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ДатаСоздания", пм_ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Таблица.Колонки.Добавить("Ид", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ИмяПакета", Новый ОписаниеТипов("Строка")); // Для связи с таблицей пакетов
		
	Возврат Таблица;
	
КонецФункции

Функция НоваяТаблицаКатегорий()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
		
	Возврат Таблица;
	
КонецФункции

Функция НовыйРезультатЗагрузкиПакета()

	Результат = Новый Структура;
	Результат.Вставить("ИмяПакета", "");
	Результат.Вставить("Версия", "");	
	Результат.Вставить("ТекстОшибки", "");
	
	Возврат Результат;
		
КонецФункции

Функция РегуляркаПроверкиСтабильнойВерсии()

	Возврат "^\d+\.\d+\.\d+$";	

КонецФункции

Функция РегуляркаПроверкиПредварительнойВерсии()

	Возврат "^\d+\.\d+\.\d+-rc\d+$";	

КонецФункции

Функция РегуляркаПроверкиВерсииРазработки()

	Возврат "^\d+\.\d+\.\d+-dev\..*$";	

КонецФункции

#КонецОбласти

#КонецЕсли
